

List<String> problem =
[
  "عدم وجود العربية في الموقع المحدد",
  "عدم توفر وسائل الراحة الأساسية داخل العربية.",
  "توجيهات غير واضحة للركاب.",
  "عدم الاستجابة لشكاوى الركاب.",
  "تدهور حالة العربية مع مرور الوقت.",
  "نصيحة",

];
List<String> solution =
[
  "يمكنك توفير خيارات بديلة للركاب في حالة عدم توافر العربية في الموقع المحدد، مثل توفير سيارة أجرة بديلة أو إعادة جدولة الرحلة لوقت لاحق.",
  "قم بالاهتمام بصيانة العربيات والتأكد من توفر وسائل الراحة الأساسية مثل التكييف والإضاءة والمقاعد المريحة.",
  "قم بتوفير توجيهات واضحة ومفصلة للركاب بخصوص الموقع المحدد والتعليمات الخاصة بالحجز والدفع، سواء عبر تطبيق الهاتف المحمول أو موقع الويب.",
  "قم بتخصيص فريق لمتابعة ومعالجة شكاوى الركاب بسرعة وفعالية، وضمان استجابة سريعة لأي مشاكل تواجهها الركاب.",
  "قم بإجراء صيانة دورية ومنتظمة للعربيات، وأجرِ الإصلاحات اللازمة في حالة حدوث مشاكل ميكانيكية، وضمان سلامة الركاب وجودة الخدمة.",
  "يُشجعك على التعامل بجدية مع هذه المشاكل والعمل على تحسين خدمتك بشكل مستمر، بالاستماع لملاحظات الركاب وتعزيز التواصل معهم. هذا سيساعدك على بناء سمعة جيدة وزيادة رضا العملاء والاحتفاظ بهم في المستقبل.",
  "حسنا شكرا لك سيتم التواصل معك في أقرب وقت.",
];
